#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: logica0419, Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113602061919]
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113602061920]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113602061922]
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113602061930]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113602061937]
sakuracloud_disk.k8s_rook_disk[6]: Refreshing state... [id=113602061941]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113602061942]
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113602061925]
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113602061933]
sakuracloud_disk.k8s_rook_disk[7]: Refreshing state... [id=113602061935]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113602061940]
data.sakuracloud_archive.ubuntu_archive: Reading...
data.sakuracloud_archive.ubuntu_archive: Read complete after 0s [id=113601947038]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113602061928]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113602061921]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113602061934]
sakuracloud_disk.k8s_worker_node_disk[6]: Refreshing state... [id=113602061936]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113602061924]
sakuracloud_disk.k8s_router_disk[0]: Refreshing state... [id=113602061923]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113602061943]
sakuracloud_disk.k8s_worker_node_disk[7]: Refreshing state... [id=113602061944]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113602061927]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113602061926]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113602061938]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113602061931]
sakuracloud_vpc_router.k8s_internal_router: Refreshing state... [id=113602061945]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113602061952]
sakuracloud_server.k8s_router[0]: Refreshing state... [id=113602061950]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113602061959]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113602061961]
sakuracloud_server.k8s_worker_node[7]: Refreshing state... [id=113602061971]
sakuracloud_server.k8s_worker_node[5]: Refreshing state... [id=113602061973]
sakuracloud_server.k8s_worker_node[6]: Refreshing state... [id=113602061980]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113602061986]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113602061969]
sakuracloud_server.k8s_worker_node[3]: Refreshing state... [id=113602061972]
sakuracloud_server.k8s_worker_node[4]: Refreshing state... [id=113602061970]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113602061982]
sakuracloud_subnet.bgp_subnet: Refreshing state... [id=20065]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113602061921" -> (known after apply)
        name                 = "k8s-dev-control-plane-1"
      ~ server_id            = "113602061959" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113602061928" -> (known after apply)
        name                 = "k8s-dev-control-plane-2"
      ~ server_id            = "113602061961" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                   = "113602061924" -> (known after apply)
        name                 = "k8s-dev-control-plane-3"
      ~ server_id            = "113602061952" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_router_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_router_disk" {
      ~ id                   = "113602061923" -> (known after apply)
        name                 = "k8s-dev-router-1"
      ~ server_id            = "113602061950" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602061931" -> (known after apply)
        name                 = "k8s-dev-worker-node-1"
      ~ server_id            = "113602061969" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602061934" -> (known after apply)
        name                 = "k8s-dev-worker-node-2"
      ~ server_id            = "113602061986" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602061927" -> (known after apply)
        name                 = "k8s-dev-worker-node-3"
      ~ server_id            = "113602061982" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[3] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602061943" -> (known after apply)
        name                 = "k8s-dev-worker-node-4"
      ~ server_id            = "113602061972" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[4] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602061938" -> (known after apply)
        name                 = "k8s-dev-worker-node-5"
      ~ server_id            = "113602061970" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[5] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602061926" -> (known after apply)
        name                 = "k8s-dev-worker-node-6"
      ~ server_id            = "113602061973" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[6] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602061936" -> (known after apply)
        name                 = "k8s-dev-worker-node-7"
      ~ server_id            = "113602061980" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[7] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                   = "113602061944" -> (known after apply)
        name                 = "k8s-dev-worker-node-8"
      ~ server_id            = "113602061971" -> (known after apply)
      ~ source_archive_id    = "113601947141" -> "113601947038" # forces replacement
        tags                 = [
            "dev",
            "k8s",
        ]
      ~ zone                 = "tk1b" -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113602061921",
        ] -> (known after apply)
        id                = "113602061959"
        name              = "k8s-dev-control-plane-1"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113602061928",
        ] -> (known after apply)
        id                = "113602061961"
        name              = "k8s-dev-control-plane-2"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks             = [
          - "113602061924",
        ] -> (known after apply)
        id                = "113602061952"
        name              = "k8s-dev-control-plane-3"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_router[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_router" {
      ~ disks             = [
          - "113602061923",
        ] -> (known after apply)
        id                = "113602061950"
        name              = "k8s-dev-router-1"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602061931",
          - "113602061922",
        ] -> (known after apply)
        id                = "113602061969"
        name              = "k8s-dev-worker-node-1"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602061934",
          - "113602061937",
        ] -> (known after apply)
        id                = "113602061986"
        name              = "k8s-dev-worker-node-2"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602061927",
          - "113602061942",
        ] -> (known after apply)
        id                = "113602061982"
        name              = "k8s-dev-worker-node-3"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[3] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602061943",
          - "113602061930",
        ] -> (known after apply)
        id                = "113602061972"
        name              = "k8s-dev-worker-node-4"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[4] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602061938",
          - "113602061933",
        ] -> (known after apply)
        id                = "113602061970"
        name              = "k8s-dev-worker-node-5"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[5] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602061926",
          - "113602061940",
        ] -> (known after apply)
        id                = "113602061973"
        name              = "k8s-dev-worker-node-6"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[6] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602061936",
          - "113602061941",
        ] -> (known after apply)
        id                = "113602061980"
        name              = "k8s-dev-worker-node-7"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[7] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks             = [
          - "113602061944",
          - "113602061935",
        ] -> (known after apply)
        id                = "113602061971"
        name              = "k8s-dev-worker-node-8"
        tags              = [
            "dev",
            "k8s",
        ]
        # (18 unchanged attributes hidden)

      ~ disk_edit_parameter {
          ~ password              = (sensitive value)
            # (10 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 12 to add, 12 to change, 12 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>